#Може да отворим и библиотеката с import math
from math import pi
figure=(input())
if figure=="square":
    a=float(input())
    print(f"{a*a:.3f}")
elif figure=='rectangle':
    a=float(input())
    b=float(input())
    print(f"{a*b:.3f}")
elif figure=='circle':
    r=float(input())
    print(f"{r*r*pi:.3f}")
elif figure=='triangle':
    a=float(input())
    h=float(input())
    print(f"{a*h/2:.3f}")
#Дебъгване, в пространството, което е свободно между номеа на реда и кода, като цъкна се появява червена точка.
#Маркира се в синьо реда, на който е точката.
#Когато го направя, давам десен бутон и вместо рън, давам дебъг. То ще иска да въведа нещо и като натисна Enter, ще се включи.
#От точката дето съм сложил надолу, нищо няма да се изпълни, включително и реда на точката.
#До Debugger вдясно имам една шано стрелка дето е като функция дето тръгва нагоре и после слиза. Като я натисна проверва реда.
#Ако всичко е точно, продължаваме напред, защото сме българи, тоест пак цъкаме на шано стрелката.
#Сега ако въведа нещо различно от square и цъкна стрелкичката, то ще пропусне първия if.
# Като стиге до вярното, изпълнява и пропуска от там надолу.
#
